{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mx_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "100", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mx_conv1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "100", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mx_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "100", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "mx_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "mx_pool1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mx_conv2_weight", 
      "attrs": {
        "kernel": "(4, 4)", 
        "num_filter": "150", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mx_conv2_bias", 
      "attrs": {
        "kernel": "(4, 4)", 
        "num_filter": "150", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mx_conv2", 
      "attrs": {
        "kernel": "(4, 4)", 
        "num_filter": "150", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "mx_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "mx_pool2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mx_conv3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "250", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mx_conv3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "250", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "mx_conv3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "250", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "mx_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "mx_pool3", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "mx_flatten", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mx_fc1_weight", 
      "attrs": {"num_hidden": "200"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mx_fc1_bias", 
      "attrs": {"num_hidden": "200"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "mx_fc1", 
      "attrs": {"num_hidden": "200"}, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mx_fc2_weight", 
      "attrs": {"num_hidden": "43"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mx_fc2_bias", 
      "attrs": {"num_hidden": "43"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "mx_fc2", 
      "attrs": {"num_hidden": "43"}, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[22, 0, 0], [23, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    6, 
    7, 
    11, 
    12, 
    17, 
    18, 
    20, 
    21, 
    23
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    7, 
    8, 
    9, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    17, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28
  ], 
  "heads": [[24, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}